{
    "JavaScript" : {
        "nom" : "JavaScript",
        "desc" : "JavaScript est un langage de programmation qui permet de créer du contenu mis à jour de façon dynamique, de contrôler le contenu multimédia, d'animer des images, et tout ce à quoi on peut pense.",
        "level" : "78"
    },
    "Python" : {
        "nom" : "Python",
        "desc" : "Le langage Python est un langage de programmation open source multi-plateformes et orienté objet. Grâce à des bibliothèques spécialisées, Python s'utilise pour de nombreuses situations comme le développement logiciel, l'analyse de données, ou la gestion d'infrastructures.",
        "level" : "99"
    },
    "Java" : {
        "nom" : "Java",
        "desc" : "Java est un langage de programmation inspiré du langage C++, avec un modèle de programmation orienté objet. Java permet de créer des applications complètes. Il peut également servir à créer un petit module d'application, dit applet, à intégrer dans une page Web.",
        "level" : "55"
    },
    "Kotlin" : {
        "nom" : "Kotlin",
        "desc" : "Kotlin est un langage de programmation au double paradigme, il peut aussi bien être utilisé pour de l’orienté objet que pour de la programmation fonctionnelle.",
        "level" : "50"
    },
    "C" : {
        "nom" : "C",
        "desc" : "C est un langage de programmation impératif généraliste, de bas niveau. Inventé au début des années 1970 pour réécrire Unix, C est devenu un des langages les plus utilisés, encore de nos jours.",
        "level" : "60"
    },
    "C++" : {
        "nom" : "C++",
        "desc" : "Le C++ est un langage de programmation compilé permettant la programmation sous de multiples paradigmes, dont la programmation procédurale, la programmation orientée objet et la programmation générique.",
        "level" : "75"
    },
    "LUA" : {
        "nom" : "LUA",
        "desc" : "Lua est un langage de script développé au Brésil au début des années 1990. Le code source d'un programme en Lua est traduit et exécuté sous forme de code byte par un interpréteur Lua. L'interpréteur lui-même est codé en C, ce qui permet aux programmes en Lua de disposer d'une performance élevée lors de l'exécution.",
        "level" : "100"
    },
    "C#" : {
        "nom" : "C#",
        "desc" : "C# est un langage de programmation orientée objet, commercialisé par Microsoft depuis 2002 et destiné à développer sur la plateforme Microsoft .NET. Il est basé sur le langage C++.",
        "level" : "49"
    },
    "PHP" : {
        "nom" : "PHP",
        "desc" : "PHP est un langage de programmation libre, principalement utilisé pour produire des pages Web dynamiques via un serveur HTTP, mais pouvant également fonctionner comme n'importe quel langage interprété de façon locale.",
        "level" : "85"
    },
    "HTML" : {
        "nom" : "HTML",
        "desc" : "HTML est un langage de balisage conçu pour représenter les pages web. Il permet d'écrire de l'hypertexte, de mettre en forme le texte, d'insérer des images, des liens hypertextes, des formulaires, des tableaux, etc.",
        "level" : "90"
    },
    "SQL" : {
        "nom" : "SQL",
        "desc" : "SQL est un langage informatique normalisé servant à exploiter des bases de données relationnelles. Il permet de créer, de modifier et de récupérer des données dans des bases de données relationnelles.",
        "level" : "100"
    },
    "CSS" : {
        "nom" : "CSS",
        "desc" : "CSS est un langage informatique utilisé pour mettre en forme les documents HTML. Il permet de définir la présentation des éléments HTML, comme les polices, les tailles, les couleurs, les espacements, etc.",
        "level" : "75"
    },
    "Node.js" : {
        "nom" : "Node.js",
        "desc" : "Node.js est une plateforme logicielle libre en JavaScript orientée vers les applications réseau événementielles et orientée vers les services. Il est principalement utilisé pour développer des applications réseau de haute performance et des applications serveur.",
        "level" : "65"
    },
    "Love2d" : {
        "nom" : "Love2d",
        "desc" : "Love2d est un framework libre et gratuit pour le développement de jeux vidéo. Il est écrit en C et C++ et utilise la bibliothèque Lua pour la programmation des jeux.",
        "level" : "95"
    },
    "MonoGame" : {
        "nom" : "MonoGame",
        "desc" : "MonoGame est un framework libre et gratuit pour le développement de jeux vidéo. Il est écrit en C# et utilise la bibliothèque XNA pour la programmation des jeux.",
        "level" : "60"
    },
    "Symfony" : {
        "nom" : "Symphony",
        "desc" : "Symfony est un framework libre écrit en PHP. Il est utilisé pour développer des applications web et des sites web.",
        "level" : "40"
    },
    "Git" : {
        "nom" : "Git",
        "desc" : "Git est un logiciel de gestion de versions décentralisé. Il permet de gérer des fichiers et des répertoires, et de suivre l'historique des modifications effectuées sur ces fichiers.",
        "level" : "65"
    },
    "Visual Studio" : {
        "nom" : "Visual Studio",
        "desc" : "Visual Studio est un logiciel de programmation développé par Microsoft. Il permet de développer des applications pour Windows, Android, iOS, Windows Phone, Windows Server, Windows IoT, Xbox, etc.",
        "level" : "80"
    },
    "Visual Studio Code" : {
        "nom" : "Visual Studio Code",
        "desc" : "Visual Studio Code est un éditeur de code source développé par Microsoft. Il permet de développer des applications pour Windows, Android, iOS, Windows Phone, Windows Server, Windows IoT, Xbox, etc.",
        "level" : "99"
    },
    "Suite JetBrain" : {
        "nom" : "Suite JetBrain",
        "desc" : "Suite JetBrain est un ensemble d'outils de développement développé par JetBrain. Il permet de développer des applications pour Windows, Android, iOS, Windows Phone, Windows Server, Windows IoT, Xbox, etc.",
        "level" : "85"
    },
    "Sublime Text" : {
        "nom" : "Sublime Text",
        "desc" : "Sublime Text est un éditeur de code source développé par Sublime HQ. Il permet de développer des applications pour Windows, Android, iOS, Windows Phone, Windows Server, Windows IoT, Xbox, etc.",
        "level" : "100"
    },
    "Android Studio" : {
        "nom" : "Android Studio",
        "desc" : "Android Studio est un environnement de développement intégré (IDE) pour le développement d'applications Android. Il est développé par Google et est basé sur IntelliJ IDEA.",
        "level" : "49"
    },
    "Eclipse" : {
        "nom" : "Eclipse",
        "desc" : "Eclipse est un environnement de développement intégré (IDE) pour le développement d'applications Java. Il est développé par la fondation Eclipse et est basé sur le projet open source Eclipse.",
        "level" : "45"
    },
    "Android" : {
        "nom" : "Android",
        "desc" : "Android est un système d'exploitation mobile développé par Google. Il permet de développer des applications pour Android.",
        "level" : "85"
    },
    "Windows" : {
        "nom" : "Windows",
        "desc" : "Windows est un système d'exploitation développé par Microsoft pour les ordinateurs personnels. Il permet de développer des applications pour Windows.",
        "level" : "100"
    },
    "Linux" : {
        "nom" : "Linux",
        "desc" : "Linux est un système d'exploitation libre et gratuit. Il permet de développer des applications pour Linux.",
        "level" : "70"
    },
    "MacOS" : {
        "nom" : "MacOS",
        "desc" : "MacOS est un système d'exploitation développé par Apple pour les ordinateurs personnels. Il permet de développer des applications pour MacOS.",
        "level" : "5"
    }
}